---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FbxLightEmitRectangleLength
source: html/a95d1e0b-0006-954f-799a-47d445328090.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FbxLightEmitRectangleLength Property

"Emit from Rectangle Length"

## Syntax (C#)
```csharp
public static ForgeTypeId FbxLightEmitRectangleLength { get; }
```